app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Pearl"], ["room_number", 69], ["created_at", "2021-06-09 05:27:08.709322"], ["updated_at", "2021-06-09 05:27:08.709322"]]
---
    def create
        school_class = SchoolClass.create(school_class_params)

UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 659], ["updated_at", "2021-06-09 05:27:19.237827"], ["id", 2]]
---
    def update
        @school_class.update(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_school_class
        @school_class = SchoolClass.find(params[:id])