app/controllers/students_controller.rb

    def update
        @student.update(student_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "poop"], ["updated_at", "2021-06-09 05:24:11.926917"], ["id", 1]]